[View in Colaboratory](https://colab.research.google.com/github/tkms0106/python-data-science/blob/master/python_data_science4_34.ipynb)

In [0]:
import numpy as np 
from pandas import DataFrame

In [0]:
import pandas.util.testing as tm
tm.N = 3

def unpivot(frame):
  N, K = frame.shape
  data = {'value': frame.values.ravel('F'),
         'variable': np.asarray(frame.columns).repeat(N),
         'date': np.tile(np.asarray(frame.index), K)}
  return DataFrame(data, columns=['date','variable','value'])

dframe = unpivot(tm.makeTimeDataFrame())

In [3]:
dframe

         date variable     value
0  2000-01-03        A -0.887176
1  2000-01-04        A  0.571800
2  2000-01-05        A -0.268527
3  2000-01-03        B -0.527909
4  2000-01-04        B -0.105728
5  2000-01-05        B -0.584052
6  2000-01-03        C  1.566639
7  2000-01-04        C -1.100171
8  2000-01-05        C  0.146531
9  2000-01-03        D  0.225770
10 2000-01-04        D  0.349660
11 2000-01-05        D -0.873252

In [0]:
dframe_piv = dframe.pivot('date','variable','value')

In [5]:
dframe_piv

variable           A         B         C         D
date
2000-01-03 -0.887176 -0.527909  1.566639  0.225770
2000-01-04  0.571800 -0.105728 -1.100171  0.349660
2000-01-05 -0.268527 -0.584052  0.146531 -0.873252